advancedwebdeveloper/rv32m1_sdk_riscv/boards/rv32m1_vega/wireless_examples/bluetooth/cycling_scs/bm/zero_riscy/pin_mux.c
/*
 * Copyright 2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v3.0
processor: RV32M1
package_id: RV32M1
mcu_data: ksdk2_0
processor_version: 0.0.5
board: RV32M1_VEGA
pin_labels:
- {pin_num: R14, pin_signal: LPCMP1_IN4/PTE0/EWM_IN, label: LED_STS, identifier: LED_STS}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/*FUNCTION**********************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 *END**************************************************************************/
void BOARD_InitBootPins(void) {
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins_ri5cy:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#define PIN0_IDX                         0u   /*!< Pin number for pin 0 in a port */
#define PIN1_IDX                         1u   /*!< Pin number for pin 1 in a port */
#define PIN8_IDX                         8u   /*!< Pin number for pin 8 in a port */
#define PIN9_IDX                         9u   /*!< Pin number for pin 9 in a port */
#define PIN12_IDX                       12u   /*!< Pin number for pin 12 in a port */
#define PIN29_IDX                       29u   /*!< Pin number for pin 29 in a port */
#define PIN30_IDX                       30u   /*!< Pin number for pin 30 in a port */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitPins_ri5cy
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitPins_ri5cy(void)
{
    BOARD_InitLPUART();
    CLOCK_EnableClock(kCLOCK_PortC);                           /* Clock Gate Control: 0x01u */

    PORT_SetPinMux(PORTC, PIN29_IDX, kPORT_MuxAlt2);            /* PORTC7 (pin N2) is configured as LPUART0_RX */
    PORTC->PCR[29] = ((PORTC->PCR[29] &
      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK))) /* Mask bits to zero which are setting */
        | PORT_PCR_PS(0x00u)                                   /* Pull Select: 0x00u */
        | PORT_PCR_PE(0x00u)                                   /* Pull Enable: 0x00u */
        | PORT_PCR_SRE(0x00u)                                  /* Slew Rate Enable: 0x00u */
        | PORT_PCR_ODE(0x00u)                                  /* Open Drain Enable: 0x00u */
      );
    PORT_SetPinMux(PORTC, PIN30_IDX, kPORT_MuxAlt2);            /* PORTC8 (pin P3) is configured as LPUART0_TX */
    PORTC->PCR[30] = ((PORTC->PCR[30] &
      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK))) /* Mask bits to zero which are setting */
        | PORT_PCR_PS(0x00u)                                   /* Pull Select: 0x00u */
        | PORT_PCR_PE(0x00u)                                   /* Pull Enable: 0x00u */
        | PORT_PCR_SRE(0x00u)                                  /* Slew Rate Enable: 0x00u */
        | PORT_PCR_ODE(0x00u)                                  /* Open Drain Enable: 0x00u */
      );
}


/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitPins_cm4
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitPins_cm4(void)
{
    BOARD_InitLPUART();
    CLOCK_EnableClock(kCLOCK_PortC);                           /* Clock Gate Control: 0x01u */

    PORT_SetPinMux(PORTC, PIN29_IDX, kPORT_MuxAlt2);            /* PORTC7 (pin N2) is configured as LPUART0_RX */
    PORTC->PCR[29] = ((PORTC->PCR[29] &
      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK))) /* Mask bits to zero which are setting */
        | PORT_PCR_PS(0x00u)                                   /* Pull Select: 0x00u */
        | PORT_PCR_PE(0x00u)                                   /* Pull Enable: 0x00u */
        | PORT_PCR_SRE(0x00u)                                  /* Slew Rate Enable: 0x00u */
        | PORT_PCR_ODE(0x00u)                                  /* Open Drain Enable: 0x00u */
      );
    PORT_SetPinMux(PORTC, PIN30_IDX, kPORT_MuxAlt2);            /* PORTC8 (pin P3) is configured as LPUART0_TX */
    PORTC->PCR[30] = ((PORTC->PCR[30] &
      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK))) /* Mask bits to zero which are setting */
        | PORT_PCR_PS(0x00u)                                   /* Pull Select: 0x00u */
        | PORT_PCR_PE(0x00u)                                   /* Pull Enable: 0x00u */
        | PORT_PCR_SRE(0x00u)                                  /* Slew Rate Enable: 0x00u */
        | PORT_PCR_ODE(0x00u)                                  /* Open Drain Enable: 0x00u */
      );
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins_zero_riscy:
- options: {callFromInitBoot: 'true', coreID: cm4, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitPins_zero_riscy
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitPins_zero_riscy(void)
{
    CLOCK_EnableClock(kCLOCK_PortB);                           /* Clock Gate Control: 0x01u */

