advancedwebdeveloper/rv32m1_sdk_riscv/boards/rv32m1_vega/wireless_examples/bluetooth/cycling_scs/bm/zero_riscy/pin_mux.c
    PORT_SetPinMux(PORTB, PIN0_IDX, kPORT_MuxAlt2);            /* PORTC7 (pin N2) is configured as LPUART0_RX */
    PORTB->PCR[0] = ((PORTB->PCR[0] &
      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK))) /* Mask bits to zero which are setting */
        | PORT_PCR_PS(0x00u)                                   /* Pull Select: 0x00u */
        | PORT_PCR_PE(0x00u)                                   /* Pull Enable: 0x00u */
        | PORT_PCR_SRE(0x00u)                                  /* Slew Rate Enable: 0x00u */
        | PORT_PCR_ODE(0x00u)                                  /* Open Drain Enable: 0x00u */
      );
    PORT_SetPinMux(PORTB, PIN1_IDX, kPORT_MuxAlt2);            /* PORTC8 (pin P3) is configured as LPUART0_TX */
    PORTB->PCR[1] = ((PORTB->PCR[1] &
      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK))) /* Mask bits to zero which are setting */
        | PORT_PCR_PS(0x00u)                                   /* Pull Select: 0x00u */
        | PORT_PCR_PE(0x00u)                                   /* Pull Enable: 0x00u */
        | PORT_PCR_SRE(0x00u)                                  /* Slew Rate Enable: 0x00u */
        | PORT_PCR_ODE(0x00u)                                  /* Open Drain Enable: 0x00u */
      );
}

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitPins_cm0p
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitPins_cm0p(void)
{
    CLOCK_EnableClock(kCLOCK_PortB);                           /* Clock Gate Control: 0x01u */

    PORT_SetPinMux(PORTB, PIN0_IDX, kPORT_MuxAlt2);            /* PORTC7 (pin N2) is configured as LPUART0_RX */
    PORTB->PCR[0] = ((PORTB->PCR[0] &
      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK))) /* Mask bits to zero which are setting */
        | PORT_PCR_PS(0x00u)                                   /* Pull Select: 0x00u */
        | PORT_PCR_PE(0x00u)                                   /* Pull Enable: 0x00u */
        | PORT_PCR_SRE(0x00u)                                  /* Slew Rate Enable: 0x00u */
        | PORT_PCR_ODE(0x00u)                                  /* Open Drain Enable: 0x00u */
      );
    PORT_SetPinMux(PORTB, PIN1_IDX, kPORT_MuxAlt2);            /* PORTC8 (pin P3) is configured as LPUART0_TX */
    PORTB->PCR[1] = ((PORTB->PCR[1] &
      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK))) /* Mask bits to zero which are setting */
        | PORT_PCR_PS(0x00u)                                   /* Pull Select: 0x00u */
        | PORT_PCR_PE(0x00u)                                   /* Pull Enable: 0x00u */
        | PORT_PCR_SRE(0x00u)                                  /* Slew Rate Enable: 0x00u */
        | PORT_PCR_ODE(0x00u)                                  /* Open Drain Enable: 0x00u */
      );
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitButtons:
- options: {coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: B10, peripheral: GPIOA, signal: 'GPIO, 0', pin_signal: PTA0/NMI_b, direction: INPUT, slew_rate: fast, open_drain: disable, pull_select: up, pull_enable: enable,
    passive_filter: disable}
  - {pin_num: P16, peripheral: GPIOE, signal: 'GPIO, 8', pin_signal: ADC0_SE22/PTE8/LLWU_P23/SDHC0_D5/LPUART3_RX/LPSPI3_SIN/TPM1_CH0/LPTMR2_ALT1, direction: INPUT,
    slew_rate: fast, open_drain: disable, pull_select: down, pull_enable: disable}
  - {pin_num: N16, peripheral: GPIOE, signal: 'GPIO, 9', pin_signal: ADC0_SE23/PTE9/LLWU_P24/SDHC0_CMD/LPUART3_TX/LPSPI3_PCS0/TPM1_CH1/FXIO0_D0, direction: INPUT,
    slew_rate: fast, open_drain: disable, pull_select: down, pull_enable: disable}
  - {pin_num: L12, peripheral: GPIOE, signal: 'GPIO, 12', pin_signal: PTE12/LLWU_P26/SDHC0_D2/LPI2C3_SDAS/TPM3_CLKIN/FXIO0_D2, direction: INPUT, slew_rate: fast,
    open_drain: disable, pull_select: down, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitButtons
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitButtons(void) {
  CLOCK_EnableClock(kCLOCK_PortA);                           /* Clock Gate Control: 0x01u */
  CLOCK_EnableClock(kCLOCK_PortE);                           /* Clock Gate Control: 0x01u */

  const port_pin_config_t porta0_pinB10_config = {
    kPORT_PullUp,                                            /* Internal pull-up resistor is enabled */
    kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
    kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
    kPORT_OpenDrainDisable,                                  /* Open drain is disabled */
    kPORT_LowDriveStrength,                                  /* Low drive strength is configured */
    kPORT_MuxAsGpio,                                         /* Pin is configured as PTA0 */
    kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
  };
  PORT_SetPinConfig(PORTA, PIN0_IDX, &porta0_pinB10_config); /* PORTA0 (pin B10) is configured as PTA0 */
  const port_pin_config_t porte12_pinL12_config = {
    kPORT_PullDisable,                                       /* Internal pull-up/down resistor is disabled */
    kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
    kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
    kPORT_OpenDrainDisable,                                  /* Open drain is disabled */
    kPORT_LowDriveStrength,                                  /* Low drive strength is configured */
    kPORT_MuxAsGpio,                                         /* Pin is configured as PTE12 */
    kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
  };
  PORT_SetPinConfig(PORTE, PIN12_IDX, &porte12_pinL12_config); /* PORTE12 (pin L12) is configured as PTE12 */
  const port_pin_config_t porte8_pinP16_config = {
    kPORT_PullDisable,                                       /* Internal pull-up/down resistor is disabled */
    kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
    kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
    kPORT_OpenDrainDisable,                                  /* Open drain is disabled */
    kPORT_LowDriveStrength,                                  /* Low drive strength is configured */
    kPORT_MuxAsGpio,                                         /* Pin is configured as PTE8 */
    kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
  };
  PORT_SetPinConfig(PORTE, PIN8_IDX, &porte8_pinP16_config); /* PORTE8 (pin P16) is configured as PTE8 */
  const port_pin_config_t porte9_pinN16_config = {
    kPORT_PullDisable,                                       /* Internal pull-up/down resistor is disabled */
    kPORT_FastSlewRate,                                      /* Fast slew rate is configured */
    kPORT_PassiveFilterDisable,                              /* Passive filter is disabled */
    kPORT_OpenDrainDisable,                                  /* Open drain is disabled */
    kPORT_LowDriveStrength,                                  /* Low drive strength is configured */
    kPORT_MuxAsGpio,                                         /* Pin is configured as PTE9 */
    kPORT_UnlockRegister                                     /* Pin Control Register fields [15:0] are not locked */
  };
  PORT_SetPinConfig(PORTE, PIN9_IDX, &porte9_pinN16_config); /* PORTE9 (pin N16) is configured as PTE9 */
}



#define PIN0_IDX                         0u   /*!< Pin number for pin 0 in a port */
#define PIN22_IDX                       22u   /*!< Pin number for pin 22 in a port */
#define PIN23_IDX                       23u   /*!< Pin number for pin 23 in a port */
#define PIN24_IDX                       24u   /*!< Pin number for pin 24 in a port */

