advancedwebdeveloper/rv32m1_sdk_riscv/boards/rv32m1_vega/wireless_examples/bluetooth/cycling_scs/bm/zero_riscy/pin_mux.c
#define PIN24_IDX                       24u   /*!< Pin number for pin 24 in a port */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitRGB:
- options: {coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: B6, peripheral: TPM2, signal: 'CH, 2', pin_signal: PTA22/LLWU_P2/LPSPI2_PCS2/LPI2C2_HREQ/FB_AD16/TPM2_CH2}
  - {pin_num: E6, peripheral: TPM2, signal: 'CH, 1', pin_signal: PTA23/LPSPI2_SIN/LPSPI1_PCS3/LPI2C2_SDA/FB_AD15/TPM2_CH1}
  - {pin_num: D6, peripheral: TPM2, signal: 'CH, 0', pin_signal: PTA24/LPSPI2_PCS0/LPSPI1_SCK/LPI2C2_SCL/FB_OE_b/TPM2_CH0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitRGB
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitRGB(void) {
  CLOCK_EnableClock(kCLOCK_PortA);                           /* Clock Gate Control: 0x01u */

  PORT_SetPinMux(PORTA, PIN22_IDX, kPORT_MuxAlt6);           /* PORTA22 (pin B6) is configured as TPM2_CH2 */
  PORT_SetPinMux(PORTA, PIN23_IDX, kPORT_MuxAlt6);           /* PORTA23 (pin E6) is configured as TPM2_CH1 */
  PORT_SetPinMux(PORTA, PIN24_IDX, kPORT_MuxAlt6);           /* PORTA24 (pin D6) is configured as TPM2_CH0 */
}

#define PIN4_IDX                         4u   /*!< Pin number for pin 4 in a port */
#define PIN5_IDX                         5u   /*!< Pin number for pin 5 in a port */
#define PIN6_IDX                         6u   /*!< Pin number for pin 6 in a port */
#define PIN7_IDX                         7u   /*!< Pin number for pin 7 in a port */

#define PIN20_IDX                       20u   /*!< Pin number for pin 20 in a port */
#define PIN21_IDX                       21u   /*!< Pin number for pin 21 in a port */

#define PIN22_IDX                       22u   /*!< Pin number for pin 22 in a port */

#define PIN24_IDX                       24u   /*!< Pin number for pin 24 in a port */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPI:
- options: {coreID: cm4, enableClock: 'true'}
- pin_list:
  - {pin_num: J1, peripheral: LPSPI1, signal: SCK, pin_signal: PTB20/LLWU_P11/LPSPI1_SCK/LPUART2_CTS_b/FB_CS0_b/TPM1_CH0/FXIO0_D10}
  - {pin_num: J2, peripheral: LPSPI1, signal: OUT, pin_signal: PTB21/LPSPI1_SOUT/LPUART2_RTS_b/LPI2C2_HREQ/FB_AD4/TPM1_CH1/FXIO0_D11}
  - {pin_num: L1, peripheral: LPSPI1, signal: PCS2, pin_signal: PTB22/LLWU_P12/LPSPI1_PCS2/LPUART0_CTS_b/LPI2C2_SDA/FB_AD3/TPM2_CLKIN/FXIO0_D12}
  - {pin_num: L2, peripheral: LPSPI1, signal: IN, pin_signal: PTB24/LPSPI1_SIN/LPUART0_RTS_b/LPI2C2_SCL/FB_AD2/EWM_IN/FXIO0_D13}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitSPI
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitSPI(void) {
  CLOCK_EnableClock(kCLOCK_PortB);                           /* Clock Gate Control: 0x01u */

  PORT_SetPinMux(PORTB, PIN20_IDX, kPORT_MuxAlt2);           /* PORTB20 (pin J1) is configured as LPSPI1_SCK */
  PORT_SetPinMux(PORTB, PIN21_IDX, kPORT_MuxAlt2);           /* PORTB21 (pin J2) is configured as LPSPI1_SOUT */
  PORT_SetPinMux(PORTB, PIN22_IDX, kPORT_MuxAlt2);           /* PORTB22 (pin L1) is configured as LPSPI1_PCS2 */
  PORT_SetPinMux(PORTB, PIN24_IDX, kPORT_MuxAlt2);           /* PORTB24 (pin L2) is configured as LPSPI1_SIN */
  
  PORT_SetPinMux(PORTB, PIN4_IDX, kPORT_MuxAlt2);           /* PORTB24 (pin L2) is configured as LPSPI1_SIN */
  PORT_SetPinMux(PORTB, PIN5_IDX, kPORT_MuxAlt2);           /* PORTB24 (pin L2) is configured as LPSPI1_SIN */
  PORT_SetPinMux(PORTB, PIN6_IDX, kPORT_MuxAlt2);           /* PORTB24 (pin L2) is configured as LPSPI1_SIN */
  PORT_SetPinMux(PORTB, PIN7_IDX, kPORT_MuxAlt2);           /* PORTB24 (pin L2) is configured as LPSPI1_SIN */
}

void BOARD_InitI2C(void) {
  CLOCK_EnableClock(kCLOCK_PortB);                           /* Clock Gate Control: 0x01u */
  CLOCK_EnableClock(kCLOCK_PortC);                           /* Clock Gate Control: 0x01u */

  PORT_SetPinMux(PORTC, PIN10_IDX, kPORT_MuxAlt4);           /* PORTC10 (pin R2) is configured as LPI2C0_SCL */
  PORTC->PCR[10] = ((PORTC->PCR[10] &
    (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK))) /* Mask bits to zero which are setting */
      | PORT_PCR_PS(0x01u)                                   /* Pull Select: 0x01u */
      | PORT_PCR_PE(0x01u)                                   /* Pull Enable: 0x01u */
      | PORT_PCR_SRE(0x00u)                                  /* Slew Rate Enable: 0x00u */
      | PORT_PCR_ODE(0x01u)                                  /* Open Drain Enable: 0x01u */
     );
        
  PORT_SetPinMux(PORTC, PIN9_IDX, kPORT_MuxAlt4);            /* PORTC9 (pin R1) is configured as LPI2C0_SDA */
  PORTC->PCR[9] = ((PORTC->PCR[9] &
    (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK))) /* Mask bits to zero which are setting */
      | PORT_PCR_PS(0x01u)                                   /* Pull Select: 0x01u */
      | PORT_PCR_PE(0x01u)                                   /* Pull Enable: 0x01u */
      | PORT_PCR_SRE(0x00u)                                  /* Slew Rate Enable: 0x00u */
      | PORT_PCR_ODE(0x01u)                                  /* Open Drain Enable: 0x01u */
     );
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
